## 예제 1-4 변수에 할당

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns =list('abc'))

In [3]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df_a = df

In [5]:
# a행 모든값을 100 으로 변경
df_a['a'] = 100

In [6]:
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [7]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [8]:
# 주소값 동일
id(df),id(df_a)

(2531995868272, 2531995868272)

In [ ]:
# is : [A is B] A,B 두 객체의 주소가 같은지 확인, 같으면 True 틀리면 False

In [9]:
df.values.base is df_a.values.base

True